# -*- coding: utf-8 -*-

"""
http://stackoverflow.com/questions/24613618/python-regex-insert

I have a String s

s = "x01777"
Now I want to insert a - into s at this position:

s = "x01-777"
I tried to do this with re.sub() but I can't figure out how to insert the - without deleting my regex (I need this complex structure of regex because the String I want to work with is much longer).

Actually, it looks something like this:

re.sub('\w\d\d\d\d\d', here comes my replacement, s)
How do I have to set up my replacement?

>>> import re
>>>> m = re.sub(r'(\w\d\d)(\d\d\d)', r'\1-\2', s)
>>> m
>> s = "x01777"
'x01-777'
>>> 

"""
import re
import regex 
ss = "x01777 asdf02888 y03665 this07999343422344564554643658373221434456455464365837322143445645546436583732214344564554643658373221434456"  
s3 = "FC室辽源市亚东中药有限责任公司新药推广中心广州沈运实主任020-38851196020-3885068413802908005天河北路255号1601室510610珠海东鑫制药有限公司珠海市张延辉营销总监0756-32285690756-322857013926920333珠海吉大光大国际贸易中心2508室519015安徽省天康药业有限公司安徽陈光副总肤舒宁品牌经理86550-702495686550-703246813905508839天长市仁和南路20号海南展宏医药有限公司海口市似传广经理0571-854567020571-8545231713891937345大英村2-2号海孚大厦1108室570206汤阴恒鑫药业有限责任公司霍化民董事副总经理0372-62181860372-621986813949515999北关中路89号456150山西仁源堂药业有限公司山西程漠军速立特营销中心副总经理0351-419937163815430-813883577755太原杏花岭帽儿巷2号30012精方药业股份有限公司汪海清营销公司总经理河南省同乐医药有限公司郑州王更军业务经理0371-63726890371-633861413607684413东明路41号附1号450004郑州医药股份有限公司第四分公司郑州王保明业务经理0371-69988220371-699881113064449380郑州中原路109号450052辽宁医药采购供应站新产品部辽宁刘忠文销售部主任13009403069沈阳市医药物资公司沈阳吴振明医药经营部027-24808807024-2480880713940482027沈阳和平区太原南街209号昆明积大制药有限公司昆明李欣销售经理6497641513601176118朝阳区小营路11号100101河南华北制药销售有限公司郑州周碧波常务副总经理FC室辽源市亚东中药有限责任公司新药推广中心广州沈运实主任020-38851196020-3885068413802908005天河北路255号1601室510610珠海东鑫制药有限公司珠海市张延辉营销总监0756-32285690756-322857013926920333珠海吉大光大国际贸易中心2508室519015安徽省天康药业有限公司安徽陈光副总肤舒宁品牌经理86550-702495686550-703246813905508839天长市仁和南路20号海南展宏医药有限公司海口市似传广经理0571-854567020571-8545231713891937345大英村2-2号海孚大厦1108室570206汤阴恒鑫药业有限责任公司霍化民董事副总经理0372-62181860372-621986813949515999北关中路89号456150山西仁源堂药业有限公司山西程漠军速立特营销中心副总经理0351-419937163815430-813883577755太原杏花岭帽儿巷2号30012精方药业股份有限公司汪海清营销公司总经理河南省同乐医药有限公司郑州王更军业务经理0371-63726890371-633861413607684413东明路41号附1号450004郑州医药股份有限公司第四分公司郑州王保明业务经理0371-69988220371-699881113064449380郑州中原路109号450052辽宁医药采购供应站新产品部辽宁刘忠文销售部主任13009403069沈阳市医药物资公司沈阳吴振明医药经营部027-24808807024-2480880713940482027沈阳和平区太原南街209号昆明积大制药有限公司昆明李欣销售经理6497641513601176118朝阳区小营路11号100101河南华北制药销售有限公司郑州周碧波常务副总经理 "
s33 = s3.decode('utf-8','replace')
m = re.sub(r'(\w\d\d)(\d\d\d)', r'\1-\2', ss)
print  (m)
#\.\-
m3 = re.sub(r'([0-9\-][0-9\-]*)([\u4e00-\u9fa5a][\u4e00-\u9fa5a]*)', r'\1 \2 ', s3.decode('utf-8','replace') )
m32 = re.sub(r'([0-9\-][0-9\-]*)([\u4e00-\u9fa5a][\u4e00-\u9fa5a]*)([$0-9\-][0-9\-]*)', r' \1 \2 \3 ', s3.decode('utf-8','replace'))
m33 = regex.sub(r'(\d)(\u4e00-\u9fa5a\u4e00-\u9fa5a*)', r'\1 \2', s3.decode('utf-8','replace'))
#m34 = regex.sub(r'([0-9\-][0-9\-\.]*)([\u53f7\u5ba4])', r'\1\2 ', s3.decode('utf-8','replace') ) #e.g., “12号(室)” append " "
m34 = regex.sub(r'([0-9\-][0-9\-\.]*)([\u53f7\u5ba4])', r'\1\2 ', s33 ) #e.g., “12号(室)” append " "
m35 = regex.sub(r'([0-9\-][0-9\-\.]*)([\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a]*)([$\n0-9\-\.][0-9\-\.]*)', r' \1 \2 \3 ', s3.decode('utf-8','replace') )
m36 = regex.sub(r'([0-9\-][0-9\-\.]*)([\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a]*)', r' \1 \2 ', m34 )
#m36 = regex.sub(r'([0-9\-][0-9\-\.]*)([\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a][\u4e00-\u9fa5a]*)([$\n0-9\-\.][0-9\-\.]*)', r' \1 \2 \3 ', m34 )
words = m36.split(" ")
#print  m3
outf = open("test03.out", "w")
for word in words:
  outf.write (word.encode("utf-8","replace")+"\n");
  #print word.decode('utf-8', 'replace')+" ";
outf.close()
print ("result in test03.out!")
